_posts/2016-06-25-Data Types With Functions In JavaScript.html
---
title: Data Types With Functions In JavaScript
tagline: How to implement data types in JavaScript without naked objects
layout: post
author: Francis Murillo
categories: Idea
tags: JavaScript, Functional Programming
---

<p>
So I've been learning myself some Functional JavaScript and the only
thing not easily supported obvious in it is defining <b>Data Types</b> as in
Haskell or what not. The most common implementation is to use
prototyping as means of achieving it as with the Maybe Monad or what have you.
</p>

<p>
While I have no problem with the prototyping style, I just find that
exposing the type as a object encourages me to use method chaining
and exposing state unnecessarily is a bit uncomfortable. What I would
like is that given a module, only the module can manipulate its values.
</p>

<p>
Some code might make this easier to visualize.
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #2872b2;">// </span><span style="color: #2872b2;">A data type to represent an list of size two</span>
<span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">Pair</span> = <span style="color: #ff8c00;">{</span>
    <span style="color: #bad6e2;">create</span>: <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff1493;">(</span><span style="color: #ff694d;">first</span>, <span style="color: #ff694d;">second</span><span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        <span style="color: #96a5d9; font-weight: bold;">return</span> Object.freeze<span style="color: #7fff00;">(</span><span style="color: #00bfff;">[</span>first, second<span style="color: #00bfff;">]</span><span style="color: #7fff00;">)</span>; <span style="color: #2872b2;">// </span><span style="color: #2872b2;">You think it's untouchable?</span>
    <span style="color: #ff1493;">}</span>,

    <span style="color: #bad6e2;">first</span>: <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff1493;">(</span><span style="color: #ff694d;">pair</span><span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        <span style="color: #96a5d9; font-weight: bold;">return</span> pair<span style="color: #7fff00;">[</span>0<span style="color: #7fff00;">]</span>;
    <span style="color: #ff1493;">}</span>,

    <span style="color: #bad6e2;">second</span>: <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff1493;">(</span><span style="color: #ff694d;">pair</span><span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        <span style="color: #96a5d9; font-weight: bold;">return</span> pair<span style="color: #7fff00;">[</span>1<span style="color: #7fff00;">]</span>;
    <span style="color: #ff1493;">}</span>
<span style="color: #ff8c00;">}</span>;

<span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">myPair</span> = Pair.create<span style="color: #ff8c00;">(</span><span style="color: #68f6cb;">'key'</span>, <span style="color: #68f6cb;">'value'</span><span style="color: #ff8c00;">)</span>;

myPair<span style="color: #ff8c00;">[</span>0<span style="color: #ff8c00;">]</span> = <span style="color: #68f6cb;">'hacked key'</span>; <span style="color: #2872b2;">// </span><span style="color: #2872b2;">Will not work</span>
myPair<span style="color: #ff8c00;">[</span>1<span style="color: #ff8c00;">]</span> = <span style="color: #68f6cb;">'hacked value'</span>; <span style="color: #2872b2;">// </span><span style="color: #2872b2;">Ditto</span>
</pre>
</div>

<p>
So nothing is wrong with this and you can be justified just by using
<code>Object.freeze</code> to make things immutable. What I am worried about is
dirtily copying the object and passing it through the module functions
without going through its <code>create</code> function which seems dirty.
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">copiedPair</span> = <span style="color: #ff8c00;">[</span>pair<span style="color: #ff1493;">[</span>0<span style="color: #ff1493;">]</span>, pair<span style="color: #ff1493;">[</span>1<span style="color: #ff1493;">]</span><span style="color: #ff8c00;">]</span>; <span style="color: #2872b2;">// </span><span style="color: #2872b2;">I find it dirty that I can access the contents easily</span>

console.log<span style="color: #ff8c00;">(</span>Pair.first<span style="color: #ff1493;">(</span>copiedPair<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>; <span style="color: #2872b2;">//</span><span style="color: #2872b2;">Which I find somewhat disturbing</span>
</pre>
</div>

<p>
As you can see above, I have two problems. First, you can recreate the
type value so easily without abandon. Second is that you can pass the
hacked object in and no one would know the difference. The idea is
that by using objects, they can easily be mimicked and exposed even if
you make them immutable.
</p>

<p>
I may be too paranoid but I like it when there is a little contract
between the modules and types, nothing directly accessible but the
interfaces. So how do we do it without JavaScript's powerful object
type? Well the help of functions!
</p>

<p>
Instead of using objects to represent types, let's use functions to
represent it instead. But how? <b>Thunking</b> may seem a good idea.
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">create</span> = <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff8c00;">(</span><span style="color: #ff694d;">first</span>, <span style="color: #ff694d;">second</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #96a5d9; font-weight: bold;">return</span> <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff1493;">()</span> <span style="color: #ff1493;">{</span> <span style="color: #2872b2;">// </span><span style="color: #2872b2;">Thunk it good</span>
        <span style="color: #96a5d9; font-weight: bold;">return</span> Object.freeze<span style="color: #7fff00;">(</span><span style="color: #00bfff;">[</span>first, second<span style="color: #00bfff;">]</span><span style="color: #7fff00;">)</span>;
    <span style="color: #ff1493;">}</span>;
<span style="color: #ff8c00;">}</span>;

<span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">myFunctionPair</span>= create<span style="color: #ff8c00;">(</span><span style="color: #68f6cb;">'newKey'</span>, <span style="color: #68f6cb;">'newValue'</span><span style="color: #ff8c00;">)</span>;

<span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">actualPair</span> = myFunctionPair<span style="color: #ff8c00;">()</span>; <span style="color: #2872b2;">// </span><span style="color: #2872b2;">Give it to me!</span>
</pre>
</div>

<p>
But the problem remains, how do we shield access to it? We can create a
token of sort to prevent it from being accessed without it.
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #2872b2;">// </span><span style="color: #2872b2;">Let's assume we have a secret type token</span>
Pair.secretToken = Object.create<span style="color: #ff8c00;">(</span><span style="color: #afc0fd; font-weight: bold;">null</span><span style="color: #ff8c00;">)</span>; <span style="color: #2872b2;">// </span><span style="color: #2872b2;">Quick way to create symbols in JavaScript</span>

<span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">tokenCreate</span> = <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff8c00;">(</span><span style="color: #ff694d;">first</span>, <span style="color: #ff694d;">second</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">state</span> = Object.create<span style="color: #ff1493;">(</span><span style="color: #7fff00;">[</span>first, second<span style="color: #7fff00;">]</span><span style="color: #ff1493;">)</span>;
    <span style="color: #96a5d9; font-weight: bold;">return</span> <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff1493;">(</span><span style="color: #ff694d;">accessToken</span><span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        <span style="color: #96a5d9; font-weight: bold;">return</span> accessToken === Pair.secretToken ? state : <span style="color: #afc0fd; font-weight: bold;">null</span>; <span style="color: #2872b2;">// </span><span style="color: #2872b2;">Or throw an error but that's evil</span>
    <span style="color: #ff1493;">}</span>;
<span style="color: #ff8c00;">}</span>;

<span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">tokenPair</span> = tokenCreate<span style="color: #ff8c00;">(</span>1, 2<span style="color: #ff8c00;">)</span>;

tokenPair<span style="color: #ff8c00;">()</span>; <span style="color: #2872b2;">// </span><span style="color: #2872b2;">:: null</span>
tokenPair<span style="color: #ff8c00;">(</span>Pair.secretToken<span style="color: #ff8c00;">)</span>; <span style="color: #2872b2;">// </span><span style="color: #2872b2;">:: [1, 2]</span>
</pre>
</div>

<p>
So by giving the type module a secret symbol or token, we can
effectively hide the state of the type value. Cool. We can make it
better by putting it the module's closure so that no one else can access
it.
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">generateSymbol</span> = Object.create.bind<span style="color: #ff8c00;">(</span><span style="color: #afc0fd; font-weight: bold;">null</span>, <span style="color: #afc0fd; font-weight: bold;">null</span><span style="color: #ff8c00;">)</span>; <span style="color: #2872b2;">// </span><span style="color: #2872b2;">Quick shiv</span>

<span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">stateHolder</span> = <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff8c00;">(</span><span style="color: #ff694d;">emptyValue</span>, <span style="color: #ff694d;">token</span>, <span style="color: #ff694d;">state</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span> <span style="color: #2872b2;">// </span><span style="color: #2872b2;">Let's enhance it a bit</span>
    <span style="color: #96a5d9; font-weight: bold;">return</span> <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff1493;">(</span><span style="color: #ff694d;">accessToken</span><span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        <span style="color: #96a5d9; font-weight: bold;">return</span> accessToken === token ? state : emptyValue;
    <span style="color: #ff1493;">}</span>;
<span style="color: #ff8c00;">}</span>;

<span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">TypeModule</span> = <span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff1493;">(</span><span style="color: #ff694d;">typeToken</span><span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
    <span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">Type</span> = Object.create<span style="color: #7fff00;">(</span><span style="color: #afc0fd; font-weight: bold;">null</span><span style="color: #7fff00;">)</span>;

    Object.assign<span style="color: #7fff00;">(</span>Type, <span style="color: #00bfff;">{</span>
        <span style="color: #bad6e2;">create</span>: <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ffff00;">(</span><span style="color: #ff694d;">first</span>, <span style="color: #ff694d;">second</span><span style="color: #ffff00;">)</span> <span style="color: #ffff00;">{</span>
            <span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">state</span> = Object.freeze<span style="color: #da70d6;">(</span>first, second<span style="color: #da70d6;">)</span>;

            <span style="color: #96a5d9; font-weight: bold;">return</span> stateHolder<span style="color: #da70d6;">(</span><span style="color: #afc0fd; font-weight: bold;">null</span>, typeToken, state<span style="color: #da70d6;">)</span>;
        <span style="color: #ffff00;">}</span>,

        <span style="color: #bad6e2;">first</span>: <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ffff00;">(</span><span style="color: #ff694d;">pair</span><span style="color: #ffff00;">)</span> <span style="color: #ffff00;">{</span>
            <span style="color: #96a5d9; font-weight: bold;">return</span> pair<span style="color: #da70d6;">(</span>typeToken<span style="color: #da70d6;">)[</span>0<span style="color: #da70d6;">]</span>;
        <span style="color: #ffff00;">}</span>,

        <span style="color: #bad6e2;">second</span>: <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ffff00;">(</span><span style="color: #ff694d;">pair</span><span style="color: #ffff00;">)</span> <span style="color: #ffff00;">{</span>
            <span style="color: #96a5d9; font-weight: bold;">return</span> pair<span style="color: #da70d6;">(</span>typeToken<span style="color: #da70d6;">)[</span>1<span style="color: #da70d6;">]</span>;
        <span style="color: #ffff00;">}</span>
    <span style="color: #00bfff;">}</span><span style="color: #7fff00;">)</span>;

    <span style="color: #96a5d9; font-weight: bold;">return</span> Object.freeze<span style="color: #7fff00;">(</span>Type<span style="color: #7fff00;">)</span>;
<span style="color: #ff1493;">}(</span>generateSymbol<span style="color: #7fff00;">()</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
So we solved out problem, more or less, but did we just write more
paranoid code than what it can afford? I don't know but I like it so let
me formalize it a bit.
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #2872b2;">// </span><span style="color: #2872b2;">Main Type Module</span>
<span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">Type</span> = <span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff1493;">()</span> <span style="color: #ff1493;">{</span>
    <span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">generateSymbol</span> = Object.create.bind<span style="color: #7fff00;">(</span><span style="color: #afc0fd; font-weight: bold;">null</span>, <span style="color: #afc0fd; font-weight: bold;">null</span><span style="color: #7fff00;">)</span>;

    <span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">stateHolder</span> = <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #7fff00;">(</span><span style="color: #ff694d;">emptyValue</span>, <span style="color: #ff694d;">token</span>, <span style="color: #ff694d;">state</span><span style="color: #7fff00;">)</span> <span style="color: #7fff00;">{</span> <span style="color: #2872b2;">// </span><span style="color: #2872b2;">Let's enhance it a bit</span>
        <span style="color: #96a5d9; font-weight: bold;">return</span> <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #00bfff;">(</span><span style="color: #ff694d;">accessToken</span><span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
            <span style="color: #96a5d9; font-weight: bold;">return</span> accessToken === token ? state : emptyValue;
        <span style="color: #00bfff;">}</span>;
    <span style="color: #7fff00;">}</span>;

    <span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">Module</span> = generateSymbol<span style="color: #7fff00;">()</span>;

    <span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">emptyTypeValue</span> = generateSymbol<span style="color: #7fff00;">()</span>;

    <span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">typeHolder</span> = stateHolder.bind<span style="color: #7fff00;">(</span><span style="color: #afc0fd; font-weight: bold;">null</span>, emptyTypeValue<span style="color: #7fff00;">)</span>;

    Object.assign<span style="color: #7fff00;">(</span>Module, <span style="color: #00bfff;">{</span>
        <span style="color: #bad6e2;">typeValue</span>: <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ffff00;">(</span><span style="color: #ff694d;">token</span>, <span style="color: #ff694d;">value</span><span style="color: #ffff00;">)</span> <span style="color: #ffff00;">{</span>
            <span style="color: #96a5d9; font-weight: bold;">return</span> typeHolder<span style="color: #da70d6;">(</span>token, value<span style="color: #da70d6;">)</span>;
        <span style="color: #ffff00;">}</span>,

        <span style="color: #bad6e2;">define</span>: <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ffff00;">(</span><span style="color: #ff694d;">constructor</span><span style="color: #ffff00;">)</span> <span style="color: #ffff00;">{</span>
            <span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">typeToken</span> = generateSymbol<span style="color: #da70d6;">()</span>;

            <span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">typeDefinition</span> = constructor<span style="color: #da70d6;">(</span>typeToken<span style="color: #da70d6;">)</span>;

            <span style="color: #96a5d9; font-weight: bold;">return</span> Object.freeze<span style="color: #da70d6;">(</span>typeDefinition<span style="color: #da70d6;">)</span>;
        <span style="color: #ffff00;">}</span>
    <span style="color: #00bfff;">}</span><span style="color: #7fff00;">)</span>;

    <span style="color: #96a5d9; font-weight: bold;">return</span> Object.freeze<span style="color: #7fff00;">(</span>Module<span style="color: #7fff00;">)</span>;
<span style="color: #ff1493;">}()</span><span style="color: #ff8c00;">)</span>;

<span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">Pairs</span> = Type.define<span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff1493;">(</span><span style="color: #ff694d;">typeToken</span><span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
    <span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">pairValue</span> = Type.typeValue.bind<span style="color: #7fff00;">(</span><span style="color: #afc0fd; font-weight: bold;">null</span>, typeToken<span style="color: #7fff00;">)</span>;

    <span style="color: #96a5d9; font-weight: bold;">return</span> <span style="color: #7fff00;">{</span>
        <span style="color: #bad6e2;">create</span>: <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #00bfff;">(</span><span style="color: #ff694d;">first</span>, <span style="color: #ff694d;">second</span><span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
            <span style="color: #96a5d9; font-weight: bold;">return</span> pairValue<span style="color: #ffff00;">(</span>Object.freeze<span style="color: #da70d6;">(</span><span style="color: #00ff7f;">[</span>first, second<span style="color: #00ff7f;">]</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span>;
        <span style="color: #00bfff;">}</span>,

        <span style="color: #bad6e2;">first</span>: <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #00bfff;">(</span><span style="color: #ff694d;">pair</span><span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
            <span style="color: #96a5d9; font-weight: bold;">return</span> pair<span style="color: #ffff00;">(</span>typeToken<span style="color: #ffff00;">)[</span>0<span style="color: #ffff00;">]</span>;
        <span style="color: #00bfff;">}</span>,

        <span style="color: #bad6e2;">second</span>: <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #00bfff;">(</span><span style="color: #ff694d;">pair</span><span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
            <span style="color: #96a5d9; font-weight: bold;">return</span> pair<span style="color: #ffff00;">(</span>typeToken<span style="color: #ffff00;">)[</span>1<span style="color: #ffff00;">]</span>;
        <span style="color: #00bfff;">}</span>
    <span style="color: #7fff00;">}</span>;
<span style="color: #ff1493;">}</span><span style="color: #ff8c00;">)</span>;
</pre>
</div>

<p>
If by any chance you didn't like the part that you had call the type
value function with the token each time, we can intercept all the type
functions such that when any of the arguments is of the said token type
it is automatically converted for us; that is we don't really care about
the token, we just want the value.
</p>

<div class="org-src-container">

<pre class="src src-javascript"><span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">mapObject</span> = <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff8c00;">(</span><span style="color: #ff694d;">f</span>, <span style="color: #ff694d;">object</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">mappedObject</span> = Object.create<span style="color: #ff1493;">(</span><span style="color: #afc0fd; font-weight: bold;">null</span><span style="color: #ff1493;">)</span>;

    Object.assign<span style="color: #ff1493;">(</span>mappedObject, object<span style="color: #ff1493;">)</span>; <span style="color: #2872b2;">// </span><span style="color: #2872b2;">A weird fix here when hasOwnProperty is present</span>

    Object.keys<span style="color: #ff1493;">(</span>object<span style="color: #ff1493;">)</span>.forEach<span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #7fff00;">(</span><span style="color: #ff694d;">key</span><span style="color: #7fff00;">)</span> <span style="color: #7fff00;">{</span>
        <span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">value</span> = object<span style="color: #00bfff;">[</span>key<span style="color: #00bfff;">]</span>;

        mappedObject<span style="color: #00bfff;">[</span>key<span style="color: #00bfff;">]</span> = f<span style="color: #00bfff;">(</span>value, key<span style="color: #00bfff;">)</span>;
    <span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span>;

    <span style="color: #96a5d9; font-weight: bold;">return</span> mappedObject;
<span style="color: #ff8c00;">}</span>;

<span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">mapIf</span> = <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff8c00;">(</span><span style="color: #ff694d;">p</span>, <span style="color: #ff694d;">f</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #96a5d9; font-weight: bold;">return</span> <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff1493;">(</span><span style="color: #ff694d;">value</span><span style="color: #ff1493;">)</span> <span style="color: #ff1493;">{</span>
        <span style="color: #96a5d9; font-weight: bold;">return</span> <span style="color: #7fff00;">(</span>p<span style="color: #00bfff;">(</span>value<span style="color: #00bfff;">)</span> === <span style="color: #afc0fd; font-weight: bold;">true</span><span style="color: #7fff00;">)</span> ? f<span style="color: #7fff00;">(</span>value<span style="color: #7fff00;">)</span> : value;
    <span style="color: #ff1493;">}</span>;
<span style="color: #ff8c00;">}</span>;

<span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">isFunction</span> = <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff8c00;">(</span><span style="color: #ff694d;">value</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #96a5d9; font-weight: bold;">return</span> <span style="color: #96a5d9; font-weight: bold;">typeof</span> value === <span style="color: #68f6cb;">'function'</span>;
<span style="color: #ff8c00;">}</span>;

<span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">isTypeValue</span> = <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #ff8c00;">(</span><span style="color: #ff694d;">value</span><span style="color: #ff8c00;">)</span> <span style="color: #ff8c00;">{</span>
    <span style="color: #96a5d9; font-weight: bold;">return</span> <span style="color: #afc0fd; font-weight: bold;">true</span>; <span style="color: #2872b2;">// </span><span style="color: #2872b2;">Some criteria to determine if the function is an ordinary or typed one</span>
<span style="color: #ff8c00;">}</span>;

<span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">typeToken</span> = Object.create<span style="color: #ff8c00;">(</span><span style="color: #afc0fd; font-weight: bold;">null</span><span style="color: #ff8c00;">)</span>; <span style="color: #2872b2;">// </span><span style="color: #2872b2;">The actual type token, just stubbed here for example</span>

<span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">TokenLessPair</span> = mapObject<span style="color: #ff8c00;">(</span>mapIf<span style="color: #ff1493;">(</span>isFunction, <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #7fff00;">(</span><span style="color: #ff694d;">typeFunction</span><span style="color: #7fff00;">)</span> <span style="color: #7fff00;">{</span>
    <span style="color: #96a5d9; font-weight: bold;">return</span> <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #00bfff;">(</span><span style="color: #2872b2;">/* </span><span style="color: #2872b2;">args */</span><span style="color: #00bfff;">)</span> <span style="color: #00bfff;">{</span>
        <span style="color: #96a5d9; font-weight: bold;">var</span> <span style="color: #ff694d;">args</span> = <span style="color: #ffff00;">[]</span>.slice.call<span style="color: #ffff00;">(</span><span style="color: #afc0fd; font-weight: bold;">arguments</span><span style="color: #ffff00;">)</span>,
            remappedArgs = args.map<span style="color: #ffff00;">(</span>mapIf<span style="color: #da70d6;">(</span>isTypeValue,
                                          <span style="color: #96a5d9; font-weight: bold;">function</span> <span style="color: #00ff7f;">(</span><span style="color: #ff694d;">typeValue</span><span style="color: #00ff7f;">)</span> <span style="color: #00ff7f;">{</span>
                                              <span style="color: #96a5d9; font-weight: bold;">return</span> typeValue<span style="color: #ff8247;">(</span>typeToken<span style="color: #ff8247;">)</span>
                                          <span style="color: #00ff7f;">}</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span>;

        <span style="color: #96a5d9; font-weight: bold;">return</span> typeFunction.apply<span style="color: #ffff00;">(</span><span style="color: #afc0fd; font-weight: bold;">null</span>, remappedArgs<span style="color: #ffff00;">)</span>;
    <span style="color: #00bfff;">}</span>
<span style="color: #7fff00;">}</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>;
</pre>
</div>

<p>
So with that intercepter, there is no need to worry about the token, it
is hidden as implementation detail. There are problems with this though
such as performance overhead, side effects if there are and probably
more. But again, this still works if everything is simple... which is
not the case most of the time.
</p>

<p>
The secret sauce should be how to distinguish normal and special typed
function but if there is a distinction, it gets harder to compose these
typed functions if we are not careful. For now this makes me feel good,
maybe I should write Monads with it. Till then, I'll see what I can dig
up with it.
</p>

<p>
So that's what I thought of in a few hours. What else can we do with
this style? Derived types as in Haskell? Maybe we can try that in the
next post. For now with just a few lines of code, we created some base
types good enough for some basic modules. I'm not trying to make the
ultimate type library, just something vanilla JavaScript can do for the paranoid
functional programmer.
</p>
